#include "BusData.h"

std::vector<RouteInfo> KMB_Routes = {
  {
    "69",
    {
      {"往天水圍方向", {{"D8F0A3AD8E765CE0", "水邊圍邨康水樓"}, {"6723518D536070AB", "朗屏邨悅屏樓"}}},
      {"往元朗方向", {{"A264255E81F51111", "天澤邨"}, {"4C86E1F44AE9C25B", "香港濕地公園"}}}
    }
  }
};

std::vector<RouteInfo> Citybus_Routes = {
  {
    "E11",
    {
      {"往中環方向", {{"D090", "中環"}, {"D091", "銅鑼灣"}}},
      {"往銅鑼灣方向", {{"D092", "銅鑼灣"}, {"D093", "中環"}}}
    }
  }
};

std::vector<RouteInfo> MTR_Routes = {
  {
    "K66", 
    {
      {"往朗屏方向", {{"K66-D010","大棠黃泥墩村"}, {"K66-D080","紅棗田村"}}},
      {"往大棠黃泥墩村方向", {{"K66-U010","朗屏"}, {"K66-U020","楊屋村"}}}
    }
  }
};

